content/main/20211114223436-task_management_machine.md
+++
title = "Task management machine"
author = ["System Administrator"]
draft = false
+++

## Next Task {#next-task}

All tasks are stored in the `TODO` task list.(with `TODO` heading prefix)

Among them, choose 5-6 to be focused in a few sessions, like a day or two. They are the `NEXT` tasks. Upon choosing, change their prefix to `NEXT`, and they will be displayed in the dashboard's NEXT tasks area.


### Add `NEXT` tasks {#add-next-tasks}


#### 1. Emergency {#1-dot-emergency}

When some task needed to be dealt with immediately, add them to `NEXT` tasks.


#### 2. Running out {#2-dot-running-out}

can treat every few `NEXT` tasks like a sprint. Select 5-6 tasks `NEXT`, and that's the sprint, and after all 5-6 tasks are done, the sprint's over.

Then, choose another 5-6 tasks.